[
    {
        "dream_content": "I had a horrible dream. Howard was in a coffin. I yelled and screamed at his mom that it was all her fault. I kicked myself that I hadn't waited to become a widow rather than a divorcee in order to get the insurance. I woke up feeling miserable, the dream was so icky."
    },
    {
        "dream_content": "As I was \"waking up\" from a nap, Ginny and Rosemary were perched on my bed. Ginny was doing Math. I watched her count columns, carry and write numbers as she figured and I said, \"You do math like me.\" She wasn't doing well. Then I got worried. I said, \"Oh Lord, I'm sure that I'm signed up for an intro to German class, but I forgot to go to any classes and it's late in the term. I'll flunk.\" I started looking through my filing cabinet for the register form. I saw some B'day cards scrunched in there. Rosemary said, \"Take those out.\" I had to see a boy standing on his head trying to say something but no one would listen. It was a B'day card to the devil. He had a grotesque red face, with huge reddish teeth. He was standing very large in a formal striped suit with a tie and carnation and a huge overcoat on. His coarse, snaky tail was draped around him. No fear."
    },
    {
        "dream_content": "Paul McCartney and my \"friends\" were on one side of a room, and the Arabs were on the other. A chain link fence was between us but there were gaps in it. Paul started yelling insults and taunts at the Arabs. I said, \"Stop it.\" I stood up and walked to him. The Arabs started yelling back and coming into \"our\" side of the room to fight. I was in the middle; I made them go back. Paul and the others started up again. I again tried to stop them. One Arab thanked me. Then, they all started again and I gave up. It was too big. I gathered up some things and left the room. Now I was in the hall. I said, \"I want to get away, where there's no people.\" Paul said, \"You want to go camping?\" I'm not enthused. I want a fireplace, etc. My father said, \"You can go somewhere remote, if you can handle traveling over the Texas desert.\" I ask if we can go where there are no hunters. I don't want to get shot."
    },
    {
        "dream_content": "Howard is driving a beat up VW bus. His wife Karen, the kids and I are in the bus. I am the in passenger seat. I see Howard going to sleep as he drives. I am angry. I yank the driver's seat from him. We argue. He is on a bended knee next to my right side, trying to get close to me. I feel very closed in, rigid. Karen pleads with me to see his need to drive and to be close. I'm angry and I argue that it's best for me to drive and that I don't like him anyway, so there! The brakes are weak and I have trouble stopping or slowing us down when it is needed."
    },
    {
        "dream_content": "I was a lion cub, trying to hide from a big gorilla that was going to hurt me. I would try to squeeze myself under furniture but he'd still  see me. I felt very afraid. A baby monkey would then be near me and his father, the gorilla, would look for him and that would lead him closer to me. Then I was the baby monkey and my father was after me."
    },
    {
        "dream_content": "I was aware of two good, heavy dreams. I even had the images still in my head but I was unable to verbalize what I dreamed. No sequence or objects to put names to. There was a sense of something dying so that the next phase can grow and be born and then that going away so first phase has its turn stronger."
    },
    {
        "dream_content": "I'm listening to a tape cassette and ten recordings on it. I get the tape messed up and I'm trying to rewind it back on. I am concerned because it's important. Several women are laughing an sneering at me, like I'm stalling and trying to destroy the tape. A Rolls Royce comes and stops by me. A lot of people get out. The star (like Mickey Rooney), gets out. He comes to me and we kiss. His show comes through town every so often and he sees me then and then leaves. His entourage sneer at me. We go for a walk. We kiss. Then he says, \"Sorry babe, time to leave now,\" he goes away, and then he comes back for the next visit. That is our relationship. He asks me how I've been. He asks me if I have practiced and if I'm walking better. I say, \"Sure.\" Then he starts to say goodbye and leaves and then he turns and comes back. He says, \"No, I'm staying. We'll stay together. You'll practice and I'll make sure.\" I'm pleased and not pleased all at the same time. I get what I asked for and now not sure that's what I want."
    },
    {
        "dream_content": "I'm in a class. Ethan is the teacher. In order to pass, I have to learn to shoot a rifle, drink Section 8 juice and jog. I'm back in M City. There's a male bully that challenges me. I get a new angle for my left angle, RA leaves, I jog to build up muscle tone. The Section 8 juice is light cider with a couple teaspoons of Section 9, which is hard cider. I practice hard. At the last day of class, I shoot a perfect bull's eye with a pump rifle and then with a 30-30. I drink twice as much Section 8 as anyone else. Everyone is amazed at my prowess. I'm proud. I wake up with the words \"And the light follows.\" Oh, I just remembered that as I was practicing jogging, I ran past the old house in M City. It had been removed so that there was space and light for a small, cute, cozy apartment for an old lady. As I ran by, I peeked in the windows. There was no kitchen, because someone else did her cooking. I saw a pretty Afghan, multi-colored, and a rocking chair, a single bed, with lots of lovely windows. I thought, \"Well, when she dies, they can put in a kitchen so the unit will be reusable.\""
    },
    {
        "dream_content": "This person and myself are being chased by some people. We're on a city street looking for ways to hide. I think that I'll meditate and call upon my guru. I do so. He shows up and whispers, \"Hey, over here,\" and walks away. I follow, looking around for the \"bad guys.\" He then disappears. My friend says, \"Oh! What a lovely woman is walking by,\" and I look to see my guru or I see an invisible nothing. I am quite agitated. I say, \"This is all very nice and interesting, but can this magic stuff save our asses and get us out of here before we're hurt?\" How are we going to get out of there safely?"
    },
    {
        "dream_content": "I am sweet sixteen. A man wants to make love to me, but I don't want to. He follows me. I feel uncomfortable. He says I'm deliberately turning him on. I say, \"No, I'm not.\" He grabs me and starts to rape me. I get very angry and beat the shit out of him. I lose control and hit and hit and hit. He goes away. The women's center decides to assist me even though I've not been technically raped, i.e. because of no actual penetration. I want to be alone but they all crowd into my office. I'm glad I don't have to worry about being pregnant. Now I go to another office. I have a 3 month old baby. The agency comes. A woman takes the baby. It's a happy experience. They give me a newborn, my new charge to love and nurture for 3 months or until it gets adopted. I sadly kiss the older baby goodbye and happily receive the new one. It's sleeping, so I put in on a chair by my desk to sleep. A young man comes to talk. He's quite surprised when I tell him I've had many, many children and then explain that I don't actually birth them. They're from the adoption agency."
    },
    {
        "dream_content": "2 other persons and myself are making something illegal. We are going to sell it for lots of money. Some people come and try to get the stuff away from us. One person comes and sniffs it to see if it's potent and starts to walk away with it without paying for it. I feel helpless; I want to stop them but I'm afraid to. Another person goes after them and asks for the money. I'm glad they did it. The person refuses to pay and gets arrogant. \"So what are you going to do about it?\" I pick up a small revolver and shoot the person in the neck. I feel badly but I feel better when I realize that it's a small bullet and will hurt them, but not kill them, .22 caliber. He gives us back the stuff. The one who went after the money feels sad because we'll always be in trouble or uptight because we're dealing with stuff others will always try to take away from us. I say, \"No, that's silly! We can sell this, take the money and invest it, and let the money work for us.\" Then the mother of one of us comes for dinner. We hide the stuff and camouflage the gun. I put a tape cassette over it. The \"mom\" brings a good-looking young man. Someone cooks the dinner. Each serving is a lovely bouquet of cut flowers. It's too pretty to eat. I'm glad I've already eaten my dinner."
    },
    {
        "dream_content": "I am very angry. I see my old diaries and journals and I'm aware that some people have read them without my permission. I say to them, \"I am very angry. I trusted you.\" I feel their guilt and I feel somehow that it's at least partly my fault because I left them out unattended. I feel good to say I am angry."
    },
    {
        "dream_content": "I am the piano teacher. My pupil is a young man. We start warm up exercises in duo. We sound great on the scales. It sounds like Beethoven. Co-worker Tyler is in the audience. Bruce is also. They are favorably impressed. I say, \"It's time to begin,\" and then I start to say, \"You need to...\" Ethan smiles and says, \"Aren't I ever gentle?\" He says just before I do, \"Yes, with gentle people.\""
    },
    {
        "dream_content": "It is necessary to study and learn more about femininity. I see a southern talking blonde, helpless type, and she changes into a well-dressed woman with a dark suit, a black picture hat and a red rose. She's beautiful, self-assured, and strong. Bette Davis is the director. She's pleased I've noticed I don't have to be traditional, soft and helpless to be feminine."
    },
    {
        "dream_content": "I'm going to see a movie. I see some chairs downstairs. I follow Juliet down the stairs. The stairs are clogged with coats, large art-type books, and people. I try not to step on the people. We chat as I go by. Then I look for a comfortable chair. I find one in the back. I ask Jock to carry it more forward so I can see better. He does. I find a pitcher of beer in my hand. Someone comments on it as I go by. I notice I don't have glasses. I make a joke and wonder why I have a pitcher (which the person called a vase). After all, I don't drink. Jock has 2 glasses. I say, \"Leave it to you to think of the glasses.\" I ask his help in setting up the chair. It's just a bit too big for the small space and tips over the stair edge when I try to sit. I see wheelchair tires next to the stair edge that the feet of my chair are resting on. Jock says, \"You know, I usually hold you back until you get all the facts (when he's giving me a client). I'm a little surprised and annoyed. He then is surprised at me and says, \"I misunderstood you. I thought, you know, you said about alcohol and drugs and those guys you'd pick up on and I thought you didn't like people like that and wouldn't be good at helping them, so I didn't send any of them to you.\" I am surprised."
    },
    {
        "dream_content": "I'm driving a huge diesel truck. It's automatic shift. I pull out in front of a car, not giving much room. I get past without an accident. I drive up a mountain road through a cute village. I'm tricked into going down a road that ends up being the runway for jets!"
    },
    {
        "dream_content": "Mabel and I are trying to put together a puzzle. We pick pretty beads from a basket and place them where they belong. I think Shea was there too. Later, I take some kids to the store. A couple of teens take some candy. I tell them to put it back. Then I see Paulina scooting out the door quickly. I run after her and stop her. She has candy in her mouth! I say, \"How dare you! Take it back at once! I'll lose respect and love for you.\" I am very angry, and she goes back. She and I go to the clerk. I say, \"She took this candy.\" The clerk shrugs and says, \"Oh well, teens do that.\" A man walks up to me and puts a soda bottle on the counter. He says, \"You pay for it and I'll reimburse you later.\" I am so busy with Paulina I don't really attend and agree. Then I turn to see who this is. I know him well and I laughingly agree to do so."
    },
    {
        "dream_content": "I'm in some group session, a facilitator. A woman rushes over to Eric and jumps on him. She wants to be affectionate and possibly sexual with him. Because he's blind, it startles him a great deal. He's scared. He throws himself face forward on the ground to protect himself. She is upset and angry because all she's got to contact is his back. She goes away. Eric sits up. There are tears in his eyes. He needs my support. He reaches over and envelopes me in a hug. The woman is crying too. She feels rejected. She's trying to pull Eric off me so she can be hugged by me. I tell her to wait. I say, \"I know you feel badly and I want to help, but you have to understand. Eric's blind. You scared him. He needs me more.\""
    },
    {
        "dream_content": "The girls and I are going swimming. I get in the shallow end and dog paddle around gingerly. Then I feel challenged to swim with long strokes out to the deeper area. I do so somewhat hesitantly. I stay near the pool edge and Dovre stays by to rescue me if necessary. We get out of the pool/lake. It's fairly crowded. We start to walk down the street. I have trouble walking because my both legs are in one pant leg, like in my mermaid suit. I kind of shuffle, hop along. Then it changes to normal and I walk. I notice a Christmas parade is coming down the street. It's colorful and noisy. We stop to watch it go by. My grandparents (Agnes & Clyde) are there and so is Aunt Esther. The parade is sort of happening through their living room. There are lovely, yellow, lemon-smelling candles. She sure has a lot of candles; her kids must be at that age. Grandma Agnes quarrels about a duck bowl. Rochelle is sitting on a piece of furniture doing a commercial. Half-way through, she runs out of things to day and hops down. I am annoyed at her. She finds a book and asks me to explain it to her. I start teaching about saying yes to a scene and not giving up. She seems to be interested."
    },
    {
        "dream_content": "I have a neighbor; he visits frequently. We are friends. He starts kissing me very gently and kindly. I like him very much. We realize we are going to be lovers. It's very nice. I feel happy. Then I realize the bad guy neighbor is on his way to visit me and I don't want him to know about my new relationship. I \"see\" him coming down the road. He's riding in some open air vehicle and has crows that talk. He sends one on ahead to give me the message that he's coming to visit. I hurry to get my friend out. I leave a message that I've gone to a small family birthday party at my brother's house next door and he can drop in if he wishes. I hope my good friend doesn't decide to drop by too. It would make things more difficult."
    },
    {
        "dream_content": "Now I'm in a town, maybe T City, looking for a particular drugstore that carries the medicine I need. I am looking for the Rexall Drugs. I call the operator. She finds it, but it isn't the right one. I try to remember the right name, Wal... something. Then as we are driving, I see two cars, Yitzak in one, Kim and Dan and family in the other. They had heard somehow about me needing the medicine and got it for me. A most fortuitous meeting. We chat. They are on their way to a vacation. I offer to pay for the expensive deposit on the meds and they say no! No problem because they can collect it back later."
    },
    {
        "dream_content": "I walk into an enclosed porch of a house and see Terence all dressed up in a blue suit (light blue). I exclaim, \"What a coincidence, I just dreamed about him this morning.\" I am vaguely aware that he is dead and a little surprised to see him alive. Then I see a lot of books. They are children's mysteries written by Terence. I then realize that Terence had written them. I am very surprised."
    },
    {
        "dream_content": "I am at a dance. I look lovely in a long dress. A young man comes up and asks me to go out with him. I immediately say, \"No!\" very firm. I say, \"It's my policy not to go out with anyone here.\" Then I sit down at a table. I am sandwiched between two men, one is the one I refused. I start wondering why I turned him down, aware that it scares me to think of going out with someone. I leave. The other man follows me. He likes me and I am attracted to him. He doesn't ask me anything. He just engages me in conversation and I enjoy being around him."
    },
    {
        "dream_content": "I am visiting Hector in Mexico. He and I are talking. I ask him why hasn't he written? Aren't we friends any more? He moves away from me and crosses his arms. I feel sad and curious and frustrated. Then we go downstairs to see his family. I see a list of what each son got on his 15th birthday. They get $1000 or a car. Both sisters got a party. I didn't think it was fair. I notice they have remodeled their house. We go upstairs, passing another stairway going down. I am intrigued but don't go there. I see a window and outside, a push cart with books and gifts on it. I go out to see if I shall buy anything. I decide not to. I ask where Roberto is. No one knows."
    },
    {
        "dream_content": "I am going to a movie and go upstairs to sit in a special circle chair. There's some spy stuff going on and a brand new baby. The baby would tell me to lay her under the water so she can push a button while no one looks. I let her do that and pull her out seconds before she runs out of oxygen. Finally, I protest. She assures me she's o.k. I put my hand down there and push the button myself secretly. Then the baby and I must escape. We hide in the movie crowd. Dora and Willie are there and we agree to sit together. My round chair is sort of a wheelchair. A German general spies around."
    },
    {
        "dream_content": "I see the tide come in. I don't want to go to the water, but I do. Jerome swims near me. I stay near the dock so in case I tire, I have something to hold on to. Later I go across a parking lot to get to the University. Jerome follows me. He loves me. I stand in line to pay my fee. I write a check. I have trouble gathering up all my belongings. I go to my room. Jerome is waiting for me. He looks at a scrapbook and picture of my father, another of a pig-nosed man, a valentine from Jerome where I crossed out the word \"kind\" from \"your kind teacher.\" He is hurt and annoyed, but pleading. He caresses my eyelids lovingly. He tells me he was upset that I would question his choices of clerk in front of Dovre who would go to his home and tell. I said, \"What should I do? Close my eyes to the truth? I can't.\""
    },
    {
        "dream_content": "The African bees are coming! We start taping up the windows frantically. We have to make the house secure! A fat butt man keeps going outside to see if they are coming. We ask him not to, it's too dangerous! He keeps breaking the taped seal around the screen door. We call and call to no avail. We have to lock him outside. Everyone in California had been evacuated. They start spraying. The bees are huge and black. They are coming. It's something like having a \"DADDY\" for a daddy and Marilyn Monroe for a mommy. It's sad."
    },
    {
        "dream_content": "I am an ex-con running from a Mafia boss. I'm driving a stolen mob car, black and fast. I am panicked, trying to elude them, speeding past the cars on the freeway. I see a dirt road and squeal on to it quickly. I hide in the trees. I see them slow up and look for me. I see a cotton men's plaid shirt tacked to a tree. They leave, I escape in a roll of dust. Now I am swimming in a terribly treacherous white water river. I barely make it after crashing over a water fall. I creep up over the bank to safety. I go back to the prison and sneak down the stairs hoping no one sees me. I see chickens in the cells. I make it to the front office and bravely walk straight for the front door. No one stops me. I stop myself and ask them if they remember me. The guard resting on a bunk is surprised. So is the woman clerk. I hear the news that if I don't qualify for a boxing match by 3:00 that day, I'll be locked up forever. I am trapped. I get on my knees and beg the guard to take the necessary papers over so I can qualify in proxy. I weep passionately. He relents and goes. Then a pox from mice sweeps the prison and all the inmates turn to shorn sheep. If I can't get out in time for the match, I'm doomed. One of the sheep baaing notices I haven't changed. I point out that I must have had it before or am immune."
    },
    {
        "dream_content": "I am a maid of honor at a wedding. The colors are black and white. A black curvaceous 1950's dress and long white veil. I walk up the aisle and notice the groom isn't there. He then enters from a side door. Part of the ceremony is for the groom to describe the future. He's a little embarrassed. He takes his ribbons and artfully waves them around and tells how they will be married for a number of years and then he'll fall in love with another woman and leave. He shrugs his shoulders and looks sheepish. He asks her if she's willing to continue, knowing that. She says yes. The bouquets are black flowers and ribbons. The next step of the ceremony is for everyone to light a small candle and, while singing, put their flame into the common or larger flame of the bride. I light my candle and follow the bride, singing, realizing with embarrassment that the song is \"Rashneeshee\" and my parents are probably shocked. I like the symbolism of all our little lights coming together in one large light. I drip my candle wax in the bowl. She smiles and points out it made a crooked pattern."
    },
    {
        "dream_content": "A man named Keith likes me and comes on sexually. I am drawn to him. Our lips nearly meet and I suddenly pull away, still wanting him but confused. I say \"No. I am married.\" He smiles and says, \"You want it; why don't we go away? There are lots of big rooms with fireplaces.\" I am tempted, but refuse and pull away. He starts to leave and I realize that I am not married and regret rejecting him, but it is too late."
    },
    {
        "dream_content": "A young girl has rheumatoid arthritis. Some people are trying to explain things to her to help her. I am crying. A nice man is going to help her. I think I am worried they can't and don't want to stir up her hopes. The man and I go into his familiar formal room. He tells me to look into a mirror with a heavy, gilded frame. I look and at first I can't see anything. Then I see me, sad, seated and a man (him). I, a happy, healthy me, stand between them trying to explain something."
    },
    {
        "dream_content": "Lucy is driving my car. I am giving her directions, like backup. \"Go straight. Stop now! You've only got another foot to a slight drop off.\" I couldn't imagine why I just didn't do the driving. It would be easier and safer. Jake is in the pickup as well. We are in a parking lot. We park and get out. Jake is being very apologetic and I say, \"Don't over help.\" They go ahead and I try to catch up. I call out, \"Sandy.\" I'm in an intersection. A crowd is gathering. There is some ceremony where money is being given to a disability cause. I see Lucy and Jake and then I am crowded in by many, many tall men. I look around and exclaim, \"So tall! It's not fair!\" They can see well. I'm all smashed up against some guy's beige polyester suit. Cameras are everywhere. They can't see me I'm so crowded in. Some man says,\"Where do we donate?\" And a man says, \"It's already been done.\" The money's here already and I notice I'm standing right at the center of the attention where a round baseball is. The crowd has suddenly thinned out. The cameras are gone. The excitement is over."
    },
    {
        "dream_content": "I am at Thea's house and can't get what I want. Someone tells me that Howard has died. I think, \"Oh, so young. Only 44 years old.\" I feel sad and know it will be sadder over the next few days. I go to get my car, which is broken. There are two, a van and a spiffy car. I think, \"I can't use the car because my chair won't fit in.\" The mechanic is busy and tells me he can't fix it yet and gives me a reason. I tell him I need it because Howard died and that is a stronger reason. He doesn't care. I then remember there will be an inheritanc, but I will have to fight for it. I think, \"I'll use the inheritance to get a degree in psychology, another two years of school.\" I sit in a chair like the swim lift chair and want it to go forward, but someone set the brakes and it tries to go forward like a train (chug chug chug chug) and folds over itself and is broken."
    },
    {
        "dream_content": "I go to find Lucy. I knock at her door. One of her children calls, \"Come in.\" I see that most of the furniture is moved out. I ask if Lucy is here. \"She's in the kitchen.\" So I walk to the kitchen and look out the back window and see her grooming her horse. I remember she loved that horse and must be feeling sad to leave it. A phone rings and she tells one of the kids to be sure and answer it. I realize that I will be able to talk to her if she comes in to get the phone. I walk toward the phone in the living room. Lucy comes in,; she is naked. She gets up on the wooden rickety table (the only furniture left) and undoes the lamp fixture in the ceiling. There are lots of cobwebs. She tells the girls to be careful of the strings. I say, \"I know you're busy, but could you tell me, in a nutshell, what made you do this? Just a few months ago, you were not going to have him and now you're gone.\""
    },
    {
        "dream_content": "I'm going up to the S Beach Hotel without a reservation, hoping a room is open for me. The cat (Pablito) is in the car. I'm in the passenger side. I go in and open a door. Someone, a bald man, is already in there. I apologize and try another room. An elderly couple is in there. I realize I'll probably be put in the dorm room as the conference starts Sat. night. So I at least will have a room but I am disappointed."
    },
    {
        "dream_content": "I am taking the wet clothes off a baby. She is lying on a bed and is a mess. I look for a clean shirt and find several. I choose one that's lacy and pretty, but hard to get on her. We struggle getting her hand in the arm and finally succeed. Then I take off her messy diaper and clean her up. She shits when I don't have a diaper on her. I clean that up, shuddering. Now my mother says, \"Give the baby to me and you count all this money on my bed.\" I see piles and piles of coins (change). Most of them are foreign currency. What a tiring task. I say, \"I'd rather hold the baby. I haven't had a chance to.\" She says, \"Later, you can do it later.\" I sigh and start working on the money. Then I'm helping a woman pack. There are lots of snap shots laid out on the bed, some of Willie, some of her lover. I am concerned that her husband will come in and find out! I try to gather them up. Then I must hurry and I choose the shoes to pack, discarding several \"Baby Jane\" shoes for little girls."
    },
    {
        "dream_content": "I'm going to teach a lecture on forest fires to a 3rd (4th is crossed out) grade class. I am practicing the lecture with their teacher. I am apologizing that I don't have much content information. I go to the library to find an encyclopedia to get more information. I'm going to show maps and talk about how the fires burn off all the old tangled growth that leaves room for new growth. Then, as we are going to the classroom, the thing shifts and we are now going to a cafe, De Frisco's, to reminisce on the Germany Trip with 3 or 4 other women. We sit around a table. I suggest another member of the Germany group show her pictures. But just before she starts, I pull mine out and start with the Palace of Versailles. I find as I start talking, I have lots to say and it is interesting to the others. Then we decide to play baseball. I hit a ball and run for first base and was nearly \"put out.\" The base was real close. Then I show someone a lovely wooden panel I was allowed to bring back from Paris. It fit on top of a piano we had here. Then we had to move a table that had pretty things on it back to make more room for second base. The table leg slipped and some things fell. We decided we'd meet again to finish our talks as we'd already been there 4 hours. I wrote the names of the ones who will speak and in what order. I consulted with Rena who said she would do her talk if she'd had enough to drink."
    },
    {
        "dream_content": "I'm in a car and it needs gas, oil and a tire check. I keep parking it in different places, but the station is very busy and I can't get anyone's attention. I finally drive in the gas pump line and get gas. I then start to drive to C City but must get out of the car because of a group of people parading down the street. Chuck is in the parade. A male friend calls out, \"You owe me a quarter.\" I search my pockets and only find a nickel. Chuck digs up a quarter. I say, \"Well then now, I owe you a quarter.\" I start to walk to C City. Aunt Bridget and her daughter walk with me a short way. I think,\"I hope I can make it.\" My knees have really been hurting. I then walk up and crawl up a stairway. There are handouts about counseling techniques on the steps."
    },
    {
        "dream_content": "I am at a boarding house and taking my pills. I couldn't remember how many I took, then didn't know how many more to take. A man said to me, \"You shouldn't take pills in public where kids can see you.\" I make a sarcastic remark that people can take pills in restaurants. It's not against the law. I was mad that he'd expect me to get up and walk when it was so painful."
    },
    {
        "dream_content": "My father and I are in a car and we take me to school. I carry books. He puts a book in a locker. It's a Learn German book. A man and I are rehearsing a video promo on disability awareness. I do a cheerful, charming rap. Some people come in. We are talking about relationships. I am dancing alone and enjoying dancing to the music. I start to join another woman dancing alone, but then chose to dance alone. Then this man and I discuss what kind of relationship to experiment with. He says \"good friend and boyfriend first.\" Another guy and I laugh and say, \"Wouldn't it be better to start with an educational relationship and then move to girl/boy friend and then to marriage?\" I grimace at the idea of marriage."
    },
    {
        "dream_content": "I have 2 children, a girl about 4 years old and a boy about 2 years old. I tell the girl, who is clamoring for my attention, to wait; I have to deal with the boy right now because he's being bad. I see his round, sassy face and I slap him. \"Listen to me,\" I say. I slap him again and again. \"I know what you are doing up there.\" He lives in some institutions. \"I'm going to keep you here with me until you shape up and behave right.\" He's not happy about that."
    },
    {
        "dream_content": "I see Willie. He is deciding to live or die. I am taking pictures of him with my camera. He hops and makes hand gestures and then he runs excitedly across the street to my van and pulls out a large registration card that has my name and some numbers on it. It also has huge letters that say \"SNOB-NOSED\" on it. Then I know he has decided to live."
    },
    {
        "dream_content": "I am leaving a C. Department meeting, by airplane, only something goes wrong and we have to get out. We land without crashing, but it's close! We are getting out and I check my pockets. I have change, 50-cent pieces and other coins. I have a receipt/ticket to get into the place we are going. I have someone else's ticket too."
    },
    {
        "dream_content": "I see a baby boy who has a psychological problem. He holds his legs funny. I approach him and say, \"Let me see.\" I lay him back and hold his legs like I'm changing his diaper. He has no balls. I say, \"What has your mother done?\" He looks embarrassed, like caught. His mother had hurt him when she diapered him, like molestation."
    },
    {
        "dream_content": "Someone looked at my hair and said, \"Do you like it?\" I said, \"Oh yes. It's soft and pretty. I like my hair.\" There was a feeling that my hair looked bad in that it wasn't \"properly\" fixed by culture standards, but it was surprising that I accepted and liked me as I was."
    },
    {
        "dream_content": "A girl is being noisy and interrupting. I get into a power play with her. I insist she be quiet and polite and I shake her. I put her in a high box. She starts goofing off and I insist she sit on the outside lip of the box so I can keep an eye on her. Then later I swim alone in the pool, relieved to have a few moments of quiet time."
    },
    {
        "dream_content": "I am organizing things: putting birthday cards I'd received where they can be displayed better so I can see them. Then I go downstairs and We and my mother play 'wait til you see his new girlfriend' (Jake/Nate's cousin). I go to the kitchen door and she's there looking pouty and cute. \"Where's Whoopie?\" she lisps. I laugh and look in at my mother and Lydia. \"She's here,\" I giggle. \"Is Whoopie anywhere?\" I accept her way of lisping. My mother whispers to me, \"Be careful! She's powerful.\" I laugh and lead her upstairs to find \"Whoopie.\" She follows arrogantly, telling where she'll put her things. She looks older now, maybe 50, 55. Then Jake runs past saying hurriedly, \"It's almost time for the Royal.\" We all run after him. Now we're like in India and the royal procession is approaching and we must be at our appointed place in time before the King arrives. One man calls our \"Elephant\" and doesn't even stop running as he hops up on a running elephant. He sways as he rides. We arrive at the stairs and are nearly too late. But protocol says that pushy women must go first. \"Hurry! You first,\" says Jake. She just grins and refuses. \"Now we're in trouble! If she won't go, we can't go and then the King will be upset!\" I say, \"Let me talk to her!\" Jake says, \"No, I'll take care of it.\" He pulls out his penis and twists it so that a hand rolled cigarette comes out of the end of his penis! He's going to sit and smoke it until he thinks of a solution. I am a little disgusted at the idea of putting it in his mouth as it will be a little slimy from the sperm!"
    },
    {
        "dream_content": "I am sexually excited and want to make love, but no one is around. So I decide to wait for Howard to return. It's been a long time since I've made love to him and it will please him. I feel a little uncomfortable about such a gift because I may be opening myself up to more sexual advances from him than I'll want. So I sit and wait."
    },
    {
        "dream_content": "I'm in a store and Bonnie is pushing my manual wheelchair. I see big crystals and jewelry. I start to go outside and see a man watching me. He seems friendly and I am attracted to him. Bonnie waits for me in the car. I go out and he's out there. I see a turtle with a leather coat over his shell. The man says, \"May I have that?\" He really wants it. I agree. We circle it and it starts coming closer to me. I back up into the comfortable arms of the man. The turtle comes very close and bites me. I see a tiny bloodless paper cut and say, \"Ouch! Is it poisonous?\" The man says, \"No. It's harmless.\""
    },
    {
        "dream_content": "I'm in a small room that has dirt and debris and bugs in it. I see a tiny (Alice in Wonderland) door and, curious, I open it. I see an ugly man there and say, \"Uh oh, guess I shouldn't have opened the door.\" I shut it quickly. I decide I don't want this room to be so bad, so I marshal my forces and change things. (I am aware I'm dreaming) and command the bugs to straighten things up. They march around in lines and I walk carefully so as not to smash any of them. I am repelled by them and grateful to them. They do miraculous work. In fact it is lovely and has opened up into more rooms, including the room the man had been in. I go down a hallway toward the bedrooms. I see video games. Then I see a 3-D video behind glass of real people enacting ordinary human activities. I'm like a voyager watching them. I feel sad that I'm reduced to such a lowly act. I see sexual activity and feel an orgasm."
    },
    {
        "dream_content": "Josh and I are in bed. We cuddle shyly. We don't make love but just acknowledge the possibility of later. I get up and walk down the street. Someone has called the police because it's not proper for Josh and me to be together, because of his disability. I give an eloquent lecture about discrimination."
    },
    {
        "dream_content": "I'm in a bathtub and draining the water. I stand up, being careful not to slip on the soap bars. I step into a second tub of cool water and rinse. I then dry off and get into a bathrobe. I hear a knock at the door. I wonder if I should ask, \"Who is it?\" before I open it. It might be a bad person. I don't ask, and it is Bonnie. I say, \"Come in, but as you can see, all my furniture is gone. I'm moving.\""
    },
    {
        "dream_content": "I am the only English boy in a Chinese school. They don't like me at all. They are all seated at long tables in rows. I must sit alone at a school desk. I had befriended a Chinese girl who wanted me to sit with her, but the teacher hated me and made me sit alone. So when she wasn't looking, I'd sneak between the tables back to my desk."
    },
    {
        "dream_content": "My parents are in a car. I'm following, wind in the face. We get to the school where they are going to help me do some paper work. They go in and I can't find a wheelchair ramp. Then I do and find a grumpy woman to ask directions. She takes me down a long hall, complaining that she can't breathe as she walks and hangs her shirt on a clothes line with herself in it so she can rest. I get angry at her and turn to go back and find the room. I see a sign that says \"B's Enterprises Brothel.\" I sneer, \"Who did that! \"The woman is proud to say she did. It is in vibrant pink colors."
    },
    {
        "dream_content": "I am standing on a small piece of land. There is a huge body of water to my left and in front of me. A single tree stands to my right. Someone says, \"Here's the forest.\" I laugh and say, \"Some forest!\" There is one tree left. All the rest have been chopped down. I see two people seated under the water. I wonder how they can breathe. One rises up and starts approaching me. I get scared because this is a \"siren,\" a spirit that wants to lure me away. She starts to bite on my ankle. I move so that she ends up biting the base of the ancient tree. If I'd let her bite me, I'd have been a goner. She hovers near and keeps trying. I must focus my energies on keeping away from her. I see a single line of ancient trees stretched out in front of me (in single file), the last remains of a huge and lush forest. The land is totally barren. I must walk across the cut branches (stumps) to get to safety. The water roils and seems threatening."
    },
    {
        "dream_content": "I'm in a river raft in the back. A man is in the front. I tell him I can't swim. He says, \"Hang on.\" We hit the rapids. The raft is tipping up and I throw myself onto the man to put more weight in the front. It works and I'm pleased with myself for quick thinking. I also like being there in a semi-embrace with him. We come through a tunnel of white water and are safe."
    },
    {
        "dream_content": "I am walking down the corridor of a hospital and see a new born baby in his bassinet in the hall. The mother is upset and the baby is crying. I go to the baby and caress his head and send \"loving\" vibes to it. It calms down and sleeps. The nurses are very impressed with my ability and ask me to help out with the preemie's who may die if not nurtured. I go to the nursery and am handed a tiny baby that fits into my hands, so unformed, it's face doesn't have skin yet, just muscle and red. I lay it on my left arm and cuddle it. I concentrate all my loving energies toward it. Now the baby looks like a baby. I go to a sink and put water on my arms as that is better for the baby. I feel a need to pee, but can't leave the baby even for a moment. A nurse suggests she get me a bed pan. I try to feed the baby and suddenly it starts sucking at the thin drops of \"mother's milk\" I offered on a tiny tube/stick. At first I'm concerned she will choke, but she really is eating and swallowing, gaining strength. I am pleased and in awe. She's gaining weight. She is surviving!"
    },
    {
        "dream_content": "Some guy brings in a box of groceries we supposedly ordered. I laugh and say, \"Oh no. We ordered Rye Crackers, not Rye brand dog food. We don't even have a dog. But, I'll accept this steak and porkchop.\" A man comes out and says, \"No, we didn't order that either.\" I say, \"Yes we did. I heard you do it.\" \"Not this steak,\" he says and gives it back. \"Trust me,\" he says and I shrug, letting go of the meat. We go back into the house and the guy starts kissing me. I like him where I hadn't before. He's the cook and has a spray of potato juice on his face."
    },
    {
        "dream_content": "I am approaching a barn, it is old, dilapidated and ugly. Inside is darkness and rotting, stinking stuff that I am supposed to clean up. I don't want to, and as I am walking to the door, I veer away, deciding not to do it. I then walk across a grassy pasture to a muddy embankment. I accidentally slip and fall, sliding down the embankment to a muddy area that is like quicksand. I am flat on my back and sinking, trapped and I know there is no way out. I am as good as dead. My sister Lydia is with me and she is already below the mud line. I see she is still alive because her eyes open and shut. It is almost time for me to go under. I feel fear and resistance, but I don't panic. I go under and am amazed I can still breathe. A wash of water goes over us, rising us, floating, out of the mud. We crawl out onto the grass. Then we get up, hugging each other and walking toward our house, which is around the left side of the barn. There are a series of Quonset huts like married student housing at OSU. The first one on the left is ours. It is old, the paint is peeling. I open the door and walk in. I see a blue cotton print dress on a dress form and I say, \"Hi, Mama.\" I realize it is a symbol of my mother. I see movement in the bedroom, my \"father\" is sick and old and in bed. I don't want to go in, but I do. His face is bumpy and old-looking. He says to me, \"I have no sons, so you will be my boy, Buck Bucko.\""
    },
    {
        "dream_content": "I opened a huge package I had wrapped up and saw it was the \"Life Monopoly\" poster/movie I was sending to Dovre. I was tired and annoyed that I made more work for myself. I am too tired to wrap it back up, but I don't want to keep it any more and wonder if Dovre will mind storing it for me. I am bored and restless. I wander around and see a man I like, but I feel like I won't get him; he's in the distance. I feel like it would be nice to connect with him, but too tired to do anything even if I could figure out what do to."
    },
    {
        "dream_content": "I see a bear off in the distance. It's the one my father, an Indian Chief, has happily pursued and hunted for years. It's his great joy to try and capture this bear. It is coming toward me and I must protect myself or it will kill me. I have my father's .22 rifle. I shoot at the bear over and over, but it only enrages him and he's close now. I aim for the eye and shoot and shoot. Now he's on top of me, mauling me. I keep shooting and finally it dies. I crawl out from under it and crawl, bleeding and maimed, to my father's horse. I put my father's rifle in the holster on the saddle and ride back to tell my father I have killed his bear. I am worried he will be upset because I've brought to an end his favorite sport. I see a small, naked Native American man. He's out of shape and his body fat is down around the belly and hips. He tries to suck it all in and his chest rises to look more manly."
    },
    {
        "dream_content": "A man, Claude, is dancing ballet on stage with a group. I am watching from backstage. It all looks fun, cultural and nice, I keep moving around to see him better. I realize I'm sort of on stage at one point and move out of the way. After the dance, he comes over. We are shy, but like each other. I'm seated on a chair and he sits on the same chair. We are close and talking. Then he puts me on his lap. I hope I don't weight too much. I wish I'd lost some weight. We have coffee/tea, drink and chat, really enjoying each other's company."
    },
    {
        "dream_content": "Now I'm in a room full of women. They are all talking and laughing. They throw dice. I am annoyed, perhaps tired and sleepy, and suggest that I throw the dice and if I win, they have to clear a quadrant of the room so I can have it to myself to sleep and have quiet. They are insulted but agree. I throw two big fluffy dice and I can't count the round black buttons correctly. At first it looks like 8 or 9. Then a woman says its 4 20's. That means I won. Someone suggests I go out and sleep in the hall, where one of the dice had rolled. I am agreeable; it's further from the noisy chatter; but I stay in the room and sleep on my quadrant that I won. I wish they'd quiet down so I could sleep (curled up on the floor.)"
    },
    {
        "dream_content": "I see my mother rushing to help Aunt Rosalie. My mother straightens up some clothes and puts them where she wants them, even though Rosalie has different ideas. My mother is pushy and controlling. I turn to Aunt Millie and say, \"She is so annoying.\" Aunt Millie says, \"You should have seen her as we grew up!\" I see my mother's intense, determined, angry face and I think, \"How sad, that was my mother, my 'nurturing' part.\""
    },
    {
        "dream_content": "I enter a square room that is sort of a vacation cabin. It has been unused and neglected for years. Today I am cleaning it up. Old food, all moldy and yucky, is in cupboards and the sink and on counters. I don't relish the job but it must be done, so I dig in and start cleaning. Howard is around somewhere."
    },
    {
        "dream_content": "I did research on a board game and played it myself to understand it. It involves movie stars. I now am sharing the game with a group of friends: Hillary of Merton Circle, Bob M of Counseling and two other women. I look up to the ceiling and see four large glass or ceramic things we'd somehow secured up there. One is a large cat ceramic (like the one on my fireplace). Another is a dog one, like a cookie jar. One is a huge red glass bowl with ornate embossed patterns on it, very Victorian and beautiful. I notice it's crooked and may fall. I am concerned because we are seated right under it. In the game, there is a MaMa card and a Doctor card. There are four categories to choose from. One is a picture of a young girl (7-8 years old) fleeing from a woman, perhaps in Indian (eastern) dress or early 1900's dress. The theme is the girl was hurt very badly by her mother. I don't remember the other three categories. I see Ginger Rogers seated near the board. She is one of the women in the group, and I say, \"You were my mother in a movie. I'm not surprised you don't remember, I had forgotten too.\" Now I'm having trouble remembering how to play the game and it is getting boring. I fold it up like an accordion credit card holder, wondering why I thought it was such a good game."
    },
    {
        "dream_content": "I am living at home with my parents in M City. I have three cars and someone delivers some oil. It squirts out of the hose and leaks all over as it fills a tank outside the house. I feel better having it full now. I get in my red car with a floor stick shift and start to drive. I turn the corner to the left and squeal out, liking the good way the car is running. I feel pleased that I have three running cars now and Howard doesn't have as much. I feel a bit sorry for him, and as I drive I realize he wants to talk to me and wonder what it's about. I am feeling a bit superior about being better off than Howard. Then I remember I still live with my parents and feel embarrassed because I should at this age be out on my own. Even though I need someone to live in and help me, I could do that with a roommate. That would be more adult than relying on my parents."
    },
    {
        "dream_content": "We are told to line up around the room and start on the bottom shelf of books. It's a book sale and we are all grabbing the books we want to buy. Someone on my left grabs a book in my section, I say, \"I already have it, it's OK,\" and move on. Now I see a display of glass pretties. Someone exchanges the little glass pitcher or creamer with another one that matches the bowl already there. It's like my mother's cranberry sauce bowl, glass rounded ribs. I say, \"Very nice, but probably more expensive and too big to be in scale.\" I go on. I remember to look for a video camera case to fit my video camera and ask a man. He is condescending and looks for an ordinary case. I am annoyed. Can't he see? I say, \"If you would just look at MY camera, you would see it is a more complex and advanced camera.\" I am annoyed he doesn't realize I'm quite good at this and not just average or a beginner."
    },
    {
        "dream_content": "I am running to help, wounded as the gunfire and machine gun fire is all around me. I leap over two brick walls to get to them. I try to fix their wounds. Then I see a cardboard box and realize a baby is in there. I pull off layer after layer of cardboard some with writing on it from the baby's mother, I finally find the baby in a plastic molded container like she was a doll. I take her out and feel immense relief for her. I hold her and kiss her and hug her, knowing she had a very traumatic time in the dark and want her to feel loved and whole. She has short cute blonde hair and wears a blue jammie. She is happy and not badly traumatized by her experience."
    },
    {
        "dream_content": "I am walking down a sidewalk and a homeless woman lies down and wraps herself in a black blanket to my left. I stand there and look at her. It seems she did this deliberately so I will notice her. I see she has the blanket wrapped tightly around her and over her head because it is very cold outside. I look at her exposed feet in moccasin shoes and watch to see if she is shivering. She isn't. I choose to walk away from her, feeling a bit guilty for not trying to help."
    },
    {
        "dream_content": "Paulina (my daughter) and I are invited to come to a ceremony for the children by a Native American man. We agree and think it will be very interesting. We are looking forward to it. Unbeknownst to me, the man wants to marry me and is setting up this ceremony to camouflage the wedding ceremony. So Paulina and start walking and soon find ourselves out in a desert area like near M City. No one else is around and the road seems unmarked. We wonder if we are in the right place. I look back and see the dirt road and some people coming out way far back. So I know we are just ahead of everyone else. We continue on. Then we see some wooden houses, white man buildings, and realize that in order to make us comfortable, they have built this little village. We look at each building and admire it. They are cute. Now the Native American man comes to me and suggests I sit with the children during the ceremony rather than in the bleachers with the audience. I agree. He then shows me an ordinary smoking pipe and says if this is handed to me, I must hold it in my cupped hands just as he shows me, or I will offend the gods. I agree and watch carefully. I ask how I should return it after I have taken a smoke. He says, \"Turn it this way (full circle, clockwise) and hand the pipe stem first.\" I listen carefully and nod. The ceremony begins."
    },
    {
        "dream_content": "I am seated at a round table with other people and we are being guarded by alien beings (sort of reptilian). They are feeding us to fatten us up to eat us later. I realize this and pass my food on to the others so I won't get fat. I hope they don't notice. I watch them carefully, feeling fear because I know at some point I shall have to make a stand and will probably be killed. At one point I am somehow flying up the outside wall and peeking inside a window where two aliens are going to make love. As they do, I overhear one saying in horror, \"You have a white cross mark on your hand.\" This means that their blood will kill him if he contacts it. I then know how I can save myself. Now I am back at the table and I try to set up a fight between aliens so their bad blood will kill themselves off. I hope I'm not killed in the process."
    },
    {
        "dream_content": "I am driving a motorcycle \"car\" with two seats. It's sort of a race. I must stop for gas very often, like every ten feet or so, and I keep forgetting to turn the engine back on. Then I spin my wheels, wasting the gas. A dark-haired young woman in an emerald green outfit is racing me. She is behind me and never smiles. She'd ask me when I stop for gas and then I'd pass her on the road. The road is curvy like a curved staircase. A young man (maybe Dwight) is in the passenger seat. I think I wear the old-fashioned motorcycle hat with flaps over the ears, made of leather."
    },
    {
        "dream_content": "There is a bad guy that can emanate some horrible, painful sound or radiation that keeps everyone his prisoner. Just at the moment he turns it on, I as a superman kind of being disintegrate and disperse my molecules as I fly up and away. He's upset I got away. But now I must go back and fight him in order to save my family, now frozen in his power. I go, via instructions from some feminine voice, to a platform up in the clouds and there are some remote control-like game boards in a basket. I pick up one. The voice says, \"This one can be adapted well.\" I look at it closer. It is a chess game, electronic. I say \"Ah, the good old chess game,\" satisfied it can be modified to fight this powerful man and save my family. I turn it over and look at the back side of it and see the tiny shapes of the black \"men\" or pieces. I want to review the rules of how they are allowed to move."
    },
    {
        "dream_content": "I am in a wheelchair and decide to go out the front door of this hotel. I open the door and a car is parked right by the door. I ask someone to help me and I get out of my chair and get into the passenger side of the car. The other person then takes the wheels off the chair and folds it and puts it in the car with me. I thank them, shut the door and now transfer over to the driver's side of the car and open that door. I pull out a tool and reach for the parts of the chair to reassemble it. I was using the car as a transition to get to the driveway so I can continue on. I realize I am making a lot of work for myself. There must be an easier way. I start to sew the button on a sweater, which is putting the wheels back on the chair, sort of. One side of the sweater is pink and the other side is blue (like reversible). The button is big, white and thick. This is going to take lots of time and energy."
    },
    {
        "dream_content": "They belong to the bad guy. The male robot man is there and Ellie says he should be allowed to listen to baseball games. He loves them. The bad guy says, \"Well, why not?\" He puts his arm around him and says, \"Is that what you want?\" The robot doesn't respond but Ellie insists that is what he wants. Another bad guy robot says he can't hear them, so let him read about it. Ellie insists he can hear them. She says he's audio. (NLP) I grab him and lay him down, with my legs wrapped around him in a wrestler hold and I say things and watch his eye patterns. \"Yes, he is audio,\" I confirm. The woman robot says she wants to be pregnant. The bad guy agrees. The second bad guy robot says, \"How can you do this?\" The bad guy says, \"It's OK, it's just hypnotist stuff.\" They do it and then I have them back. The robot bad guy says, \"Then I have a favor to ask of you. Will you put this package in MY car? (he owns it but because he's a robot the other guy uses it) and put a nice saying with it.\" I put my arm around his shoulder and hug him teasingly, \"You mean something sentimental and nice?\" I ask. \"Like \"1-2-3-4, beat it, beat it.\" It's a joke and I laugh."
    },
    {
        "dream_content": "Howard and I are in a house. I walk to a back room I haven't been paying attention to. I see a window pane is broken and a large bush is growing in through the hole. I see that someone has tried to fix the window problem. Howard comes in and wants us to talk. I groan, laughing a bit at myself and my resistance to this connection. He is gentle and coaxes me to sit beside him. I point out the broken window and say I hadn't noticed it, but obviously someone did. I was glad they did."
    },
    {
        "dream_content": "Now I am at another table and am exposing the man who isn't what he says he is. Everyone is shocked to learn this. I feel bad doing this, but it is necessary. Now I go to the window and see a store and people are going in and out and then I realize it is on fire. I see some smoke in the second story. I see people still trying to go in and think that is strange they would chance going shopping in a burning building, although the fire isn't seen yet as it is still small. Then the building suddenly is gone and I am shocked. It is supposed to be there but all I see is a new street intersection. I realize I am looking at a future picture. Later I am at a table with a woman and a woman bartender talking about dreams. We are impressed with their completeness and beauty. Later out the window I see the building again."
    },
    {
        "dream_content": "I am at a table-like thing; cousin Sebastian and others are there. I am eating my toast and then I want the toast left over on the other end of the table. I can't seem to fill myself up. I lick the jelly off a yellow plastic thing and then get a bit queasy when I realize the paint is in with the jelly. I need to pee, so I go to the women's room. There are two tiny potty chairs, already being used. I go stand up over a toilet no one is supposed to use and pull the shower curtain closed around it. I pee. Delores M comes in. We chat."
    },
    {
        "dream_content": "I am lying on a couch, dead like. I look around the room and see it is still exactly like the moment the accident happened that killed me. A plant like my angel wing begonia lies in pieces on the floor where it was knocked over. A woman picks it up and brings the stem and leaves to me and says, \"Look. Part of this is still alive. But it is without care and water for so long, but if you take care of it, it will live again.\" I am saddened and amazed that this could be revived. I sit up, now realizing I too am alive. My parents (sort of like Grandma Mildred and Grandpa Lloyd) are in the room and I get up and walk to them. They are shocked and happy to see I am alive. I go to Grandpa \"dad\" and he is seated in an easy chair, and I say to him, \"Don't ever do this again. You left me for dead.\" He apologizes and his eyes are sad as he realizes what he did. I go back and sit on the couch and look out the window. High up on the hill is a new building, the new schoolhouse. My friends are there. I wave at them and my best friend sees me and they all run down to see me, so glad I am alive again. They swarm into the house. I am excited to see them. A man is there, a boyfriend of my friend, or my boyfriend. We all hug in reunion. I go out with them to get on the bus."
    },
    {
        "dream_content": "I am a housewife and cleaning up the apartment. It is constant work and I do it willingly. I fold clothes, do the dishes, cook meals, and care for the small kittens. I pick it up and cuddle it saying in a soft sweet voice, \"Oh, there's the little kitty.\" Later, I have children, two half-grown boys and a six-year-old girl. I then am lighting the candles and am dressed in a 1950's housewife, pretty for my hubby, and he walks in the door with an unexpected dinner guest.  I am distressed, but handle it gently and with dignity. Later, I am cleaning up, he's now drunk and off to bed calling for me to come to bed and I am still cleaning up the sink from after the dinner. Woman's work is never done."
    },
    {
        "dream_content": "I have to pee really bad. I am in a house. Some man is injured and I am helping him. A cat is there somewhere, maybe also needing help. I go into a bathroom and try to sit on the toilet. It breaks off from the wall and is wobbly. I am standing and peeing so I won't tip it over. I pee voraciously all down my leg and around the room in front of me. I am concerned the water will back up and flow out of the toilet onto the floor. I leave. Now I am going from room to room in a hotel-like exhibit. I look out the window and see the beautiful emerald green ocean waves far below. There is a crowd of people walking through the exhibit as I am. I really need to pee and consider finding an exhibit toilet and using it. One room has a whirlpool and a single bed with an air mattress-like thing, sort of a health spa room. I wonder where people sleep and see another room with beds in it. I go out the door and go to the next exhibit room. On the way I see parrot beaded earrings and go over to see the price: 1 or 2 dollars, very cheap. I don't really want the parrots, but like crystal things or beaded things."
    },
    {
        "dream_content": "I am at some campground where a conference is being held. Mary and Lucy are there. I go ahead to get us a seat at the luncheon tables, big round tables with pink tablecloths on them. I find one very close to where the speaker will be and secure a spot, saving a couple of spots for my friends. Other people are trying to sit at the table. Suddenly I realize that Deepak Chopra is sitting at the table. I see he looks ill. He has a snot booger hanging off his nose and looks bad. I say sympathetically, \"You look ill.\" He smiles weakly. I try to help him. I offer to sort his speeches in chronological order for him. Later I go to his house with him as we'd struck up a relationship, but there aren't ramps and it is hard to get in and out. I gently chide him that he is not very sensitive to the disabled, even though he is one himself. Later I am W. talking with a couple of male friends about stuff and mention my co-worker John."
    },
    {
        "dream_content": "I want to attend a seminar, like the Chopra one. I line up very early to get a good seat up front. Then I am told it is being held in another spot and I go there to discover I'm a bit late and only get a spot in some other more distant section. It even requires another entrance at another field, called \"Hunsaker \"or something like that. I start to try and find the place to go and am told I have to take a shuttle bus thing there. As I am going to the bus stop, I tell some woman the story of how people resent people with disabilities and tell the Chopra story of the woman who said, \"You have kind of an advantage, don't you?\" I find a bus stop, but I'm not sure this is the right spot and I do not want to miss the bus. One comes from the wrong direction and stops and I run over to ask the driver if this is the right one or not. I nearly get hit by the bus as it pulls up to the stop. It is \"articulated.\" He looks down at me and I can't seem to understand him, whether this is the one or not. I finally decide this is the one going to the station and go back to my spot to wait. The seminar seems so distant now."
    },
    {
        "dream_content": "I am standing in a public bathroom in a health clinic place and combing my hair. I am very upset, because I scratched a sore scab and it is coming off with my hair attached (like my psoriasis of long ago) and I have bald spots. I am looking in the mirror at all the ugly black and blue bald spots and bloody lines where I've scratched them. Maybe my daughter Ellie, or someone like her, agrees to shampoo my hair and color it with dye. My hair is a dark black now. I don't know how I like that (color of June's hair). My blouse and bra are off and now two old men, gay men, get in the bathtub to do therapy together. I feel a bit uncomfortable, being so naked, but think, \"Oh well, it's OK. This is a clinic.\" I turn and am now putting on my bra. One of the old men, now out of the tub says, \"I hope she keeps the cleavage. It's great cleavage.\" I look into his eyes and he has on weird glasses like opera glasses inset into his eyes. I hurriedly try to get dressed. There is another room where patients are being treated, mental therapy. I am pacing. I am now a man. My friend comes in and asks where I am, even though I am pacing right past him. Other people (women) in the room laugh. I say, \"Vagina,\" and a man laughs archly, \"Aha.\" I am upset he misunderstood me and say, \"No, not that meaning. I was trying to explain about a woman being pregnant.\""
    },
    {
        "dream_content": "Ellie comes over with Charla. She says she wants me to baby-sit her so she can go out to breakfast. She seems shy and hesitant. I think, \"Well she might, after all we've been through.\" Ellie comes over to me, her face soft and child-like, and starts to hug me. Then she curls around me and wants to nurse, pulling my breast out of the bra. I am shocked. I say, \"What are you doing?\" She says something like a 4-year-old child might. She nurses. I know something is very wrong and don't know what to do. I remain calm. The sexual feeling of the nursing is beginning and I know she has regressed to some childhood place and I want to support her, but this is so odd. I can't do much other than tolerate the moment. I try to pat her and lay my arm around her, but I am not genuinely being her mother as a 4-year-old might want. I gently distract her from the nursing. It is clear now Ellie has a severe mental regression problem. Charla is clear and direct and her own energetic self. My mother calls me asking if I'd found the first aid papers yet. I say, \"No, I have a real big crisis here and haven't had time to look.\" Ellie wraps her body around me. I say to her, \"You are a 25-year-old woman, with a child. You need to act like one.\" Ellie doesn't seem to notice, she's so off in her own world. I know I have to have her committed. I'm not sure how to do that."
    },
    {
        "dream_content": "Sparky wants to plug in a string of Christmas lights that have a short circuit in them, or rather the switch in the wall does. The lights go on and off. I suggest she try another switch or plug in. Kenneth comes in dressed in a graduation gown, a witch's hat and funky platform-heeled shoes. Sparky is a bit taken aback. I say, \"He's like that,\" somewhat proudly. Kenneth grabs the string of lights and says, \"Let's try plugging them in over here.\" I am pleased he has the same thoughts as I do and acts upon them. Now he's hungry and wants to eat. He grabs a hamburger from a buffet bar in the center of the room and another one for Sparky. She says she doesn't want it. So he puts it back and places two sandwiches there. A fat, bald baby is sitting there and she takes a huge bite out of the sandwich. I go to her to stop her from eating Kenneth's food. Her mouth is overflowing with mayo. She's sliding off the high chair. I have a bag in my left hand and am trying to keep her from falling off the chair and keep feeding her too. I wonder why I didn't think to put down the bag so I could use both hands. Then a man is laying on the floor. His face is pudgy and bald like the baby's. He says he's joined the Marines. I say, teasing, \"They only want a few good men,\" and he and I say together, \"but if you're not a good man, they'll make your life hell.\" We laugh."
    },
    {
        "dream_content": "Derek is painting pictures of mountains. I am trying to paint one too. I have my palette and see a sort of yellowish color up in the right hand corner, an odd color for the sky. Derek starts to dabble in my colors and I ask him not to. I then awkwardly attempt to paint. I draw a steep-peaked mountain and remember what my father said about how mountains aren't really that steep. I redraw it in softer curves. I discover how leaving some portions of the canvas blank and using that whiteness as a part of the picture enhances the picture. I create many different mountain ranges with some kind of building structure in the left corner foreground. It's pretty good."
    },
    {
        "dream_content": "I am nervous and sitting on a toilet, having belly cramps. Rochelle is around asking me questions about why I act the way I do. I explain, something about getting nervous and needing to go to the bathroom. I see my mother and say something like, \"It's not like you ever taught us how to be emotionally intimate.\" Then I am spreading thick gobs of butter on already buttered toast."
    },
    {
        "dream_content": "A rather stupid, lanky man is asking me questions. I hold a package with a small plastic bag of white beads in it. It is a beading kit. He asks me what the words on the package says. I say, \"Stretched string beads.\" He asks how many beads there are. Are there enough to bead a whole shirt? I answer gruffly, \"How would I know? It doesn't say.\" I am annoyed with his attitude and questions. The man says, \"Why don't you lighten up?\" I realize I am being sharp and grumpy, but I say, \"Because I don't want to,\" which is true. This IS the way I feel and I don't want to change it right now."
    },
    {
        "dream_content": "I am in the M City house, sleeping in my bedroom. I open my eyes and see my \"dad\" walking up to my open bedroom door. He is tall and lanky like Nate. He is so tall, his head is above the doorjamb. I feel fear. He is going to harass me. He then walks down the stairs to go to the bathroom. I sneak out of my room and run into my brother's room (actually the room my parents had). I crawl under the covers with one of my brothers trying to hurriedly pull up the covers over me. He's coming back up the stairs and I know a part of my shoulder may be visible. I know this won't work and I'll probably got my brothers in trouble too, but I stay there. He comes in and looks around. I think he sees me, but lets me be. He leaves. I go quickly back into my bedroom to the closet to try and change clothes before he comes back. As I pull a dress off a hanger, I am standing in the closet, which seems to have lots of room. A weird-looking girl comes and watches me. I tell her to go away. I pull on my dress, which I wonder if it is too fancy and will call attention to myself. I go downstairs to the kitchen where my mother is fixing French toast for breakfast. She wants me to do something and is grumpy."
    },
    {
        "dream_content": "I seem to be the prison warden. The men are surly and dangerous. I have to stop something and I use fast karate blows. I am damn good at it and beat my foe. Another powerful inmate is watching me closely, looking for his opportunity. I then go to the infirmary for the doctor to bind up my wounds, but he is also my fiance and he rejects me, I think because he doesn't want me doing this dangerous job. I am hurt, but bravely go on. I return, exhausted and emotionally drained, to my office and find a young woman and a Hispanic man trying to make out on the floor by my door. I tell her to be in my office at 3 o'clock and I'll teach her about birth control and then I decide the man better be there too. This was yet another betrayal and I am angry and self-righteous, and yet I'm trying to be doing the right thing for these people too. I enter, but it isn't my office; it is a courtroom. I interrogate the prisoner who is on trial, the man I beat up, and the other powerful man is secretly sending him signals by scraping the legs of his chair against the floor when he should not answer. I realize this is a code even though it is subtle. I am on the alert."
    },
    {
        "dream_content": "I am moving to an old house with odd rooms that spread out all over. Dwight/Howard is going to help me. Lucy and two babies are there. I am holding one and she is holding the other. We are trying to get them to nap as I walk around trying to think and organize how to manage this huge task. Finally, I get the baby to sleep. I open a door and it is a small bathroom. Really, only a bathtub is in it. I look at the kitchen, which has two or three wooden oak tables (dining room type) hanging way up on the wall for counter space. That will be awkward. Dwight/Howard comes in and I am frustrated trying to get his attention. He finally listens to my ideas but sighs and says, \"It won't work. We made a mistake buying this rambling house and a mistake moving to M City. We belong back in the valley, so let's not take such care where things go and only unpack the essentials until we can move again.\" He then suggests we be friends again. I say, \"No way.\" Now I kind of give up and sit on the couch with an older woman. I make a snide remark about how she can't work either because she's so old, and I can't work, cause I'm so old too. It's a sort of frustrated joke. Nothing seems to be going right. No one is helping."
    },
    {
        "dream_content": "I am in a room and my stepfather and my \"mother\" and some other people are there. I am experiencing some pain on the inside of my mouth on the right cheek, like I bit it and it is sore. The stepfather is distant and not helpful as I point out my pain."
    },
    {
        "dream_content": "I am in a kitchen and notice the piled up dishes and mess. I feel bad. I haven't cleaned up for years. Howard probably is tired of that. I try to do some dishes and find a pretty cobalt blue pitcher where the handle and the spout are on the edge seams of the square corners. It's really cute. It has the words \"Howard's Place\" printed on it in white ink. Now I can't get the kitchen faucets to close down no matter how I turn them. I finally ask Howard how to do it. He is in the bathroom showering and I knock on the door. He calls out how. I do it. Then I go into another kitchen; more mess. I sigh. I must have not done a thing for a long time. I feel sorry for poor Howard, living in these conditions. I feel energy to clean and start in."
    },
    {
        "dream_content": "I am upset with myself because for years I'd been taking a few classes here and there and often not finishing them or doing the work. I have a long string of incompletes on my transcript. I am wishing now that I had chosen a 2-year master's program and just focused on that and done it. I'd have something by now if I'd done that. Some how this has to do with moving to a new city to turn over a new leaf, many years ago. The feeling is that in some other dream I had moved to a city to start school. Now in this dream I'm at the other end. So I try to do some homework and now I go to the school office to pay my tuition and fill out papers. The secretary is busy and I watch a mentally retarded girl lean over the counter, laying on it in my way, so I walk to the right and catch a secretary's attention. She asks for $56. I hand her a sealed envelope with my tuition in it. I thought it was to be $53. She opens it and pulls out a piece of paper where I had drawn pictures. I look at it and am surprised to see many different pictures of my cat in different poses and postures. I thought I'd only done one. I point out the empty spot where the mentally retarded girl had blocked my way. The secretary says, \"That's a cold spot.\" I say yes, because that's the feeling I got from it."
    },
    {
        "dream_content": "I am at some big college-like school. Some of the women students have stolen a recently dead man's corpse and are playing with it, doing some silly witch-like rituals over it for fun. I and a woman friend are shocked to see this (in the gym). After they are done, the audience is leaving and so are we. I say to my friend, \"Come on, let's follow and see if we can retrieve the corpse and take it back where it belongs.\" My friend is in agreement and is surprised I cared enough to do this. We figured the element of surprise will be with us, because we are so quick to go to where I am sure they are going to leave it, namely in the sorority lunch room activity center area. I search and search, in drawers, opening doors, etc. and finally find a box which it might be in. I pick it up and sneak off to find the male professor that it goes to. I go down the halls hoping to remember his name. I find a college of his and ask to talk to him. I begin to wonder just who I can trust here."
    },
    {
        "dream_content": "The first moment I laid eyes on this white, large, two-story house, I loved it. The woman who owns it says she'll sell it to me and I can move in right now and we'll do the papers later. I and my daughters start to move in. Each can have their own bedroom, the outside lawn is spacious and pretty, the rooms large and comfortable. I begin to be concerned because I haven't even asked how much for the house and if I will qualify for a bank loan for that amount. I am tired of living in my cramped little house, but it was the best I could afford. This will be much more. I see the short, almost midget-sized woman who owns it and go to her. I say, \"I want to talk about the details before I get all moved in and then have to leave.\" She is busy driving a tractor towing a cart and I follow her, talking all the while. She smiles and wants to know what that other woman said about her. I say, \"Nothing much.\" I didn't really listen. She says, \"Good. Don't worry. We'll make a deal.\" She wants me to have the house."
    },
    {
        "dream_content": "I am preparing to do a performance at a meeting. The woman boss is talking and I realize I don't have my scripts with me for the play. I start looking around the office. I make a mess with all the papers I look through. As I am frantically searching, I also notice that the audience is off in another part of the room, partitioned off. If we moved ourselves into their room, we would be seen better. I check and see that there is plenty of room beyond the office partition. I wonder why we were told to do it in the office in the first place. I am worried that I can't remember the words or the sequence of things we are supposed to do. I am unhappy, and frantic."
    }
]